Autodesk.Revit.DB.FamilyElementVisibilityType
Indicates the Visibility type of generic forms.
Remarks: Use this enum to indicate the visibility type
of new forms.

Autodesk.Revit.DB.FamilyElementVisibilityType.ViewSpecific
The element will be displayed only in the view where it is created. This
applies to items like detail components, annotations, and view-specific imports.

Autodesk.Revit.DB.FamilyElementVisibilityType.Model
The element will be displayed in 3D views and model other model views.